[
  {
    "perguntas": [
      "O que é luz?",
      "Explique a luz.",
      "Como consigo enxergar as coisas?"
    ],
    "resposta": "Luz é uma onda eletromagnética que nos permite ver objetos ao refletir ou emitir radiação visível. Sem luz, nossos olhos não conseguem captar imagens.",
    "tags": ["óptica", "luz", "conceito"]
  },
  {
    "perguntas": [
      "O que é reflexão da luz?",
      "Explique reflexão.",
      "Por que vejo meu rosto no espelho?"
    ],
    "resposta": "Reflexão é quando a luz bate em uma superfície e retorna. É isso que permite ver imagens em espelhos ou superfícies lisas.",
    "tags": ["óptica", "reflexão", "cotidiano"]
  },
  {
    "perguntas": [
      "O que é refração da luz?",
      "Explique refração.",
      "Por que o canudo parece torto na água?"
    ],
    "resposta": "Refração é a mudança de direção da luz ao passar de um meio para outro, como do ar para a água, fazendo objetos parecerem deslocados ou deformados.",
    "tags": ["óptica", "refração", "cotidiano"]
  },
  {
    "perguntas": [
      "O que é difração?",
      "Explique difração da luz.",
      "Como a luz contorna obstáculos?"
    ],
    "resposta": "Difração é a capacidade da luz de se curvar ao passar por fendas ou contornar obstáculos, criando padrões de interferência.",
    "tags": ["óptica", "difração", "fenômeno"]
  },
  {
    "perguntas": [
      "O que é dispersão da luz?",
      "Explique arco-íris.",
      "Como a luz se separa em cores?"
    ],
    "resposta": "Dispersão ocorre quando a luz branca se separa em diferentes cores ao passar por um prisma ou gotas de água, formando fenômenos como o arco-íris.",
    "tags": ["óptica", "dispersão", "cores"]
  },
  {
    "perguntas": [
      "O que é absorção da luz?",
      "Explique absorção.",
      "Por que roupas escuras esquentam mais?"
    ],
    "resposta": "Absorção é quando a luz é absorvida por um material, convertendo-se em calor ou energia interna, o que faz objetos esquentarem.",
    "tags": ["óptica", "absorção", "cotidiano"]
  },
  {
    "perguntas": [
      "O que é sombra?",
      "Explique como se forma uma sombra.",
      "Por que meu corpo projeta sombra no chão?"
    ],
    "resposta": "Sombra é a região onde a luz é bloqueada por um objeto. Quanto mais intensa a luz, mais nítida será a sombra.",
    "tags": ["óptica", "sombra", "cotidiano"]
  },
  {
    "perguntas": [
      "O que é penumbra?",
      "Explique a penumbra.",
      "Por que a sombra às vezes não é escura totalmente?"
    ],
    "resposta": "Penumbra é a área da sombra onde a luz é parcialmente bloqueada, criando regiões de sombra parcial ao redor de sombras mais definidas.",
    "tags": ["óptica", "penumbra", "fenômeno"]
  },
  {
    "perguntas": [
      "O que são lentes?",
      "Explique lentes.",
      "Como meus óculos me ajudam a enxergar melhor?"
    ],
    "resposta": "Lentes são peças transparentes que desviam a luz para formar imagens. Elas podem corrigir a visão ou ampliar objetos em lupas e microscópios.",
    "tags": ["óptica", "lentes", "aplicações"]
  },
  {
    "perguntas": [
      "O que é fóton?",
      "Explique partículas de luz.",
      "Como a luz pode ser partícula?"
    ],
    "resposta": "Fóton é a menor unidade de luz, uma partícula que transporta energia eletromagnética. A luz se comporta tanto como onda quanto partícula, dependendo da situação.",
    "tags": ["óptica", "fóton", "conceito"]
  },
  {
    "perguntas": [
      "O que é lente convergente?",
      "Explique lente convergente.",
      "Como uma lupa aumenta objetos?"
    ],
    "resposta": "Lente convergente é aquela que faz os raios de luz se encontrarem em um ponto, permitindo ampliar objetos, como em lupas ou câmeras.",
    "tags": ["óptica", "lente", "aplicação", "convergente"]
  },
  {
    "perguntas": [
      "O que é lente divergente?",
      "Explique lente divergente.",
      "Como óculos corrigem miopia?"
    ],
    "resposta": "Lente divergente espalha os raios de luz, corrigindo problemas de visão como a miopia e ajudando a formar imagens nítidas na retina.",
    "tags": ["óptica", "lente", "aplicação", "divergente"]
  },
  {
    "perguntas": [
      "O que é laser?",
      "Explique laser.",
      "Como o laser corta coisas ou aponta?"
    ],
    "resposta": "Laser é um feixe de luz altamente concentrado, com ondas todas na mesma frequência e direção. Ele é usado em cortes, leitura de CDs, cirurgias e comunicação óptica.",
    "tags": ["óptica", "laser", "aplicação", "tecnologia"]
  },
  {
    "perguntas": [
      "O que é fibra óptica?",
      "Explique fibra óptica.",
      "Como a internet chega rápido pela luz?"
    ],
    "resposta": "Fibra óptica é um fio de vidro ou plástico que transporta sinais de luz, permitindo a transmissão de dados em alta velocidade, como na internet e em telecomunicações.",
    "tags": ["óptica", "fibra óptica", "aplicação", "tecnologia"]
  },
  {
    "perguntas": [
      "O que é espectro de luz?",
      "Explique espectro.",
      "Como vemos as cores no arco-íris?"
    ],
    "resposta": "Espectro de luz é a separação das cores da luz branca, mostrando todas as cores visíveis. É o que forma o arco-íris e é usado em prismas e espectroscopia.",
    "tags": ["óptica", "luz", "cores", "fenômeno"]
  },
  {
    "perguntas": [
      "O que é polarização da luz?",
      "Explique polarização.",
      "Por que óculos de sol filtram o brilho?"
    ],
    "resposta": "Polarização é quando a luz vibra em apenas uma direção. Óculos polarizados filtram luz refletida, reduzindo brilho e melhorando a visão.",
    "tags": ["óptica", "polarização", "aplicação", "cotidiano"]
  },
  {
    "perguntas": [
      "Como funcionam microscópios e telescópios?",
      "Explique microscópios e telescópios.",
      "Como conseguimos ver coisas muito pequenas ou distantes?"
    ],
    "resposta": "Microscópios usam lentes para ampliar objetos muito pequenos, e telescópios concentram a luz para ver objetos distantes, ambos aproveitando propriedades da luz e das lentes.",
    "tags": ["óptica", "instrumentos", "aplicação", "tecnologia"]
  },
  {
    "perguntas": [
      "O que é interferência da luz?",
      "Explique interferência.",
      "Como formam aquelas cores em bolhas de sabão?"
    ],
    "resposta": "Interferência acontece quando ondas de luz se sobrepõem, reforçando ou cancelando cores, como nas bolhas de sabão ou filmes finos de óleo.",
    "tags": ["óptica", "interferência", "fenômeno", "cotidiano"]
  },
  {
    "perguntas": [
      "O que são espelhos côncavos?",
      "Explique espelhos côncavos.",
      "Como espelhos de maquiagem ampliam o rosto?"
    ],
    "resposta": "Espelhos côncavos refletem a luz de modo que converge em um ponto, ampliando a imagem de objetos próximos, como em espelhos de maquiagem ou faróis de carro.",
    "tags": ["óptica", "espelhos", "aplicação", "côncavo"]
  },
  {
    "perguntas": [
      "O que são espelhos convexos?",
      "Explique espelhos convexos.",
      "Por que espelhos de rua mostram área maior?"
    ],
    "resposta": "Espelhos convexos refletem a luz de forma divergente, permitindo que vejamos uma área maior, como nos espelhos de segurança em ruas e lojas.",
    "tags": ["óptica", "espelhos", "aplicação", "convexo"]
  },
  {
    "perguntas": [
      "O que é refração da luz?",
      "Explique refração.",
      "Por que um canudo parece quebrado na água?"
    ],
    "resposta": "Refração é a mudança de direção da luz ao passar de um meio para outro, como do ar para a água. É o que faz o canudo parecer 'quebrado' dentro do copo.",
    "tags": ["óptica", "refração", "fenômeno", "cotidiano"]
  },
  {
    "perguntas": [
      "O que é dispersão da luz?",
      "Explique dispersão.",
      "Como o prisma separa a luz em cores?"
    ],
    "resposta": "Dispersão ocorre quando diferentes cores da luz se desviam em ângulos diferentes ao passar por um meio, como um prisma separando a luz branca em todas as cores.",
    "tags": ["óptica", "dispersão", "fenômeno", "cores"]
  },
  {
    "perguntas": [
      "O que é difração da luz?",
      "Explique difração.",
      "Como a luz se curva ao passar por uma fresta?"
    ],
    "resposta": "Difração é o desvio da luz ao contornar obstáculos ou passar por fendas estreitas, criando padrões de interferência visíveis.",
    "tags": ["óptica", "difração", "fenômeno", "experimento"]
  },
  {
    "perguntas": [
      "O que é efeito Doppler na luz?",
      "Explique efeito Doppler.",
      "Por que algumas estrelas mudam de cor quando se afastam?"
    ],
    "resposta": "O efeito Doppler é a mudança na frequência da luz percebida quando a fonte se move. Estrelas que se afastam parecem mais vermelhas e as que se aproximam mais azuis.",
    "tags": ["óptica", "Doppler", "fenômeno", "astronomia"]
  },
  {
    "perguntas": [
      "Como funciona o arco-íris?",
      "Explique arco-íris.",
      "Por que vemos várias cores no céu depois da chuva?"
    ],
    "resposta": "O arco-íris aparece quando a luz do sol é refratada, refletida e dispersa pelas gotas de chuva, separando a luz branca em cores visíveis.",
    "tags": ["óptica", "arco-íris", "fenômeno", "cotidiano"]
  },
  {
    "perguntas": [
      "O que são lentes de contato?",
      "Explique lentes de contato.",
      "Como corrigem a visão sem óculos?"
    ],
    "resposta": "Lentes de contato são pequenas lentes colocadas diretamente nos olhos para corrigir problemas de visão, funcionando de maneira similar aos óculos, mas mais discretas.",
    "tags": ["óptica", "lentes", "aplicação", "cotidiano"]
  },
  {
    "perguntas": [
      "O que é imagem real e imagem virtual?",
      "Explique imagens em espelhos e lentes.",
      "Como um projetor mostra imagens na parede?"
    ],
    "resposta": "Imagem real é formada onde os raios de luz convergem e pode ser projetada. Imagem virtual é formada onde os raios parecem se encontrar, como em espelhos planos.",
    "tags": ["óptica", "imagem", "conceito", "experimento"]
  },
  {
    "perguntas": [
      "Como a luz viaja?",
      "Explique propagação da luz.",
      "Por que vemos a luz se refletindo nos objetos?"
    ],
    "resposta": "A luz se propaga em linha reta, mas pode mudar de direção ao refletir ou refratar. É por isso que conseguimos ver objetos iluminados.",
    "tags": ["óptica", "luz", "conceito", "cotidiano"]
  },
  {
    "perguntas": [
      "O que é brilho e intensidade luminosa?",
      "Explique brilho.",
      "Por que algumas lâmpadas parecem mais fortes?"
    ],
    "resposta": "Brilho ou intensidade luminosa indica quanta luz uma fonte emite. Fontes mais fortes iluminam mais, enquanto fontes fracas iluminam menos.",
    "tags": ["óptica", "luz", "conceito", "cotidiano"]
  },
  {
    "perguntas": [
      "O que são cores complementares?",
      "Explique cores complementares.",
      "Por que algumas cores ficam bonitas juntas?"
    ],
    "resposta": "Cores complementares são pares de cores que, quando misturadas, produzem luz branca ou se destacam visualmente. Por exemplo, azul e laranja são complementares.",
    "tags": ["óptica", "cores", "conceito", "cotidiano"]
  }


]
